[
    {
      "slug": "earthling-digital",
      "title": "Earthling Digital",
      "image": "https://framerusercontent.com/images/Ukqy61v951da30sVll7oZVZgHU.png",
      "year": "(2024)",
      "services": "Social Media, Website Design & Webflow Development",
      "intro": "Crafting dynamic web and graphic designs for sustainability-focused clients.",
      "headline1": "Visual",
      "headline2": "Versatility",
      "Top Section - Text #1": "Earthling Digital aimed to strengthen its position as a leading marketing agency by delivering captivating designs that effectively communicated the unique identities of various clients. The challenge was to create a cohesive visual identity across multiple platforms while catering to different brand personalities.",
      "Top Section - Text #2": "<h6><em>(Discovery)</em></h6><p>Understanding SIM's Vision.</p><p>I began by exploring Servicio Integral Motor’s identity, analyzing their target audience and competitors. Through detailed research and collaborative discussions, I identified the need for a visually striking website that reflects their premium services and commitment to excellence.</p><h6><em>(Design)</em></h6><p>Crafting an Immersive Experience.</p><p>Inspired by modern automotive aesthetics, I designed a one-page website concept rich in dynamic visuals and seamless navigation. Using references from platforms like Behance and Dribbble, I developed a layout that captures attention while highlighting the brand’s dedication to quality. Wireframes and mockups provided a clear vision, ensuring every detail aligned with the brand identity.</p><h6><em>(Results)</em></h6><p>A Design That Captivates.</p><p>The final design showcases Servicio Integral Motor’s premium services through dynamic visual elements and intuitive navigation. It transforms the browsing experience into an engaging journey, aligning perfectly with their exceptional standards and leaving a lasting impression on visitors.</p>",
      "Gallery Image #1": "https://framerusercontent.com/images/eSicUFrMl7wtFkxrtSrJcx5uw.png",
      "Gallery Image #2": "https://framerusercontent.com/images/W7bhdy8gDzEvyadfJ0hKxeV1jDU.png",
      "Gallery Image #3": "https://framerusercontent.com/images/YyX2rHzSINHaMMQA2eFILZsBBM.png",
      "link": "https://www.behance.net/gallery/211351555/Earthling-Digital-Social-Media-Design"
    },
    {
      "slug": "hacelezoom",
      "title": "#haceleZOOM",
      "image": "https://framerusercontent.com/images/olFbp51jUGgOJ5MvxrkAOaHjqE8.png",
      "year": "(2024)",
      "services": "Branding",
      "intro": "Revitalizing tradition with a bold visual identity for artists.",
      "headline1": "Beyond",
      "headline2": "Modernism",
      "Top Section - Text #1": "In a contemporary art scene dominated by modern styles, haceleZOOM emerged as a collective of three artists dedicated to reviving the rich details and timeless quality of traditional art. The challenge was to craft a visual identity and social media presence that would echo their unique focus on precision, texture, and heritage.",
      "Top Section - Text #2": "<h6><em><strong>(Discovery)</strong></em></h6><p>Honoring Tradition with a Modern Touch.</p><p>I began by understanding #haceleZOOM’s mission: to celebrate the beauty of traditional art in a contemporary landscape. Through deep discussions with the three artists and research into their work, I uncovered the textures, details, and heritage that define their collective vision. This step laid the foundation for a brand identity that reflects both their artistry and commitment to timeless craftsmanship.</p><h6><em><strong>(Design)</strong></em></h6><p>Bringing Heritage to Life.</p><p>The visual identity I developed centered on capturing the essence of traditional art while remaining relevant in the modern world. Rich textures, intricate patterns, and a warm, earthy palette formed the core of the designs. For social media, I created assets that emphasized the fine details of their work, drawing viewers into the story behind each piece. Every design decision was made to evoke the tactile, emotional connection of traditional craftsmanship.</p><h6><em><strong>(Results)</strong></em></h6><p>A Distinctive Identity in the Art World.</p><p>The resulting brand and social media presence positioned haceleZOOM as a beacon for those seeking depth and detail in art. Their unique focus on traditional techniques resonated deeply with their audience, creating a visual narrative that celebrated their craft while standing out in a sea of modern styles. This identity continues to strengthen their presence, fostering a growing appreciation for the timeless art they represent.</p>",
      "Gallery Image #1": "https://framerusercontent.com/images/BDasRrV0G3TG0Uf3oMt037g.png",
      "Gallery Image #2": "https://framerusercontent.com/images/j4TaoQFzOelaqoy2NqhRVNX4Lk.png",
      "Gallery Image #3": "https://framerusercontent.com/images/oRepTSFqpgAsav65cduzyT8fIc.png",
      "link": null
    },
    {
      "slug": "salmon",
      "title": "Salmon",
      "image": "https://framerusercontent.com/images/LSRY0WpSmV7INhffgqSukFz4.png",
      "year": "(2024)",
      "services": "Branding",
      "intro": "Shaping a fresh identity for Salmón’s innovative learning experience.",
      "headline1": "Learning,",
      "headline2": "Redefined",
      "Top Section - Text #1": "Salmón, an online learning platform, sought a modern identity that resonated with its audience without directly referencing the fish itself, in order to avoid confusion with food brands. The challenge was to create a unique design that reflected the platform's educational focus and startup vibe.",
      "Top Section - Text #2": "<p>They needed a site that not only reflected their commitment to eco-friendly products but also provided a seamless shopping experience. We focused on creating an e-commerce platform that was visually appealing, easy to navigate, and optimized for conversions.</p><p>The design incorporates bold imagery, earthy tones, and clean lines to align with Utosia’s sustainable values. Every product page was carefully crafted to highlight the unique aspects of the brand's clothing, from materials to ethical production methods. We implemented a streamlined checkout process, ensuring minimal friction for users, and integrated advanced search functionalities to help shoppers easily find the products they’re looking for.</p><p>Since launching the platform, Utosia has seen a steady increase in traffic and sales. The site’s responsiveness across mobile and desktop has further enhanced the customer experience, making it easy for users to shop from any device. This project has helped Utosia carve out a unique space in the competitive sustainable fashion market.</p>",
      "Gallery Image #1": "https://framerusercontent.com/images/D3WkXY9Fr9sJITNBJzJ3OlxmRc.png",
      "Gallery Image #2": "https://framerusercontent.com/images/8OJCBuwXWJXaZbb65pZdnwhTUI.png",
      "Gallery Image #3": "",
      "link": null
    },
    {
      "slug": "mingo",
      "title": "Mingo",
      "image": "https://framerusercontent.com/images/X29XYU7dhDd0v41kwk1Zp80WxuQ.png",
      "year": "(2023)",
      "services": "Social Media",
      "intro": "Vibrant social media designs elevating Mingo's brand presence.",
      "headline1": "Unique",
      "headline2": "By Nature",
      "Top Section - Text #1": "In a market dominated by a single player, Mingo aimed to carve out its niche in Argentina's emerging hard seltzer scene. The challenge was to position their social media brand uniquely, emphasizing a healthier lifestyle and natural ingredients sourced from Patagonia while avoiding direct competition with established brands.",
      "Top Section - Text #2": "<h6><em><strong>(Discovery)</strong></em></h6><p>Building on Mingo’s Identity.</p><p>I focused on Mingo’s established brand, aiming to highlight their emphasis on natural ingredients and active lifestyles. By understanding their audience and the challenges of the hard seltzer market in Argentina, I set out to create visually compelling social media content that would capture attention and differentiate the brand.</p><h6><em><strong>(Design)</strong></em></h6><p>Bringing the Brand to Life.</p><p>Using Adobe After Effects for motion graphics and Blender for 3D modeling of the hard seltzer cans, I crafted high-quality social media pieces that showcased Mingo’s refreshing and sporty identity. The designs featured dynamic animations and polished visuals tailored to resonate with their audience and stand out in a competitive landscape.</p><h6><em><strong>(Results)</strong></em></h6><p>Quality Content in a Challenging Market.</p><p>While the visual content effectively represented Mingo’s values and stood out in terms of quality, the brand faced significant challenges in Argentina’s hard seltzer market. Dominated by established international players like Dr. Lemon and Smirnoff Ice, and with limited consumer awareness of the category, Mingo struggled to gain traction despite the strong creative execution.</p>",
      "Gallery Image #1": "https://framerusercontent.com/images/EIHirRYnB4luyfLOGRTFQoXIfd8.png",
      "Gallery Image #2": "",
      "Gallery Image #3": "",
      "link": null
    }
  ]
  